# This query has a function to look for events where nmap leaves common figerprints when scanning web servers.

index="<index>" sourcetype IN (iis, apache) c_uri_stream IN ("*nmap*", "*nice_ports*", "*Flumemaster.jsp*", "*/Trinity.txt.bak*")
| search c_ip IN (10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16, 142.250.80.0/24, 172.253.63.0/24, 142.251.16.0/24)
| table log_data
| stats count by src_ip, User_Agent
